import os

# =============================
# Camera
# =============================

CAMERA_ID = 1

CAMERA_INDEX = os.environ.get(
    "CAMERA_RTSP_URL",
    "rtsp://admin:seniorproject2!@192.168.1.193:554/Streaming/Channels/101"
)

FRAME_W = 1500
FRAME_H = 890
DISPLAY_SCALE = 1.6
MIN_PLATE_BOX_W = 40
MIN_PLATE_BOX_H = 20

# =============================
# Model
# =============================

MODEL_PATH = "best.pt"

# =============================
# Backend
# =============================

API_BASE = "http://localhost:8000"

# =============================
# Detection
# =============================

CONF_THRESHOLD = 0.30

YOLO_EVERY_N = 1

OCR_EVERY_N = 15

OCR_MIN_CONF = 0.25

COOLDOWN_SEC = 5

EXIT_AFTER_SEC = 3

UPSCALE_TARGET_W = 1000

DEBUG_OCR = bool(os.environ.get("DEBUG_OCR"))

# =============================
# OCR
# =============================

THAI_ALLOWLIST = (
    "กขคงจฉชซญดตถทธนบปผฝพฟภมยรลวศษสหอฮ"
    "0123456789"
)

PROVINCE_ALLOWLIST = (
    "กขคงจฉชซญดตถทธนบปผฝพฟภมยรลวศษสหอฮ"
    "ะาิีึืุูเแโใไ็่้๊๋์"
)

# =============================
# Province List
# =============================

THAI_PROVINCES = [
    "กรุงเทพมหานคร","กระบี่","กาญจนบุรี","กาฬสินธุ์","กำแพงเพชร",
    "ขอนแก่น","จันทบุรี","ฉะเชิงเทรา","ชลบุรี","ชัยนาท","ชัยภูมิ",
    "ชุมพร","เชียงราย","เชียงใหม่","ตรัง","ตราด","ตาก",
    "นครนายก","นครปฐม","นครพนม","นครราชสีมา",
    "นครศรีธรรมราช","นครสวรรค์","นนทบุรี","นราธิวาส",
    "น่าน","บึงกาฬ","บุรีรัมย์","ปทุมธานี",
    "ประจวบคีรีขันธ์","ปราจีนบุรี","ปัตตานี",
    "พระนครศรีอยุธยา","พะเยา","พังงา","พัทลุง",
    "พิจิตร","พิษณุโลก","เพชรบุรี","เพชรบูรณ์",
    "แพร่","ภูเก็ต","มหาสารคาม","มุกดาหาร",
    "แม่ฮ่องสอน","ยโสธร","ยะลา","ร้อยเอ็ด",
    "ระนอง","ระยอง","ราชบุรี","ลพบุรี",
    "ลำปาง","ลำพูน","เลย","ศรีสะเกษ",
    "สกลนคร","สงขลา","สตูล","สมุทรปราการ",
    "สมุทรสงคราม","สมุทรสาคร","สระแก้ว",
    "สระบุรี","สิงห์บุรี","สุโขทัย",
    "สุพรรณบุรี","สุราษฎร์ธานี","สุรินทร์",
    "หนองคาย","หนองบัวลำภู","อ่างทอง",
    "อำนาจเจริญ","อุดรธานี","อุตรดิตถ์",
    "อุทัยธานี","อุบลราชธานี"
]